Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АС_НормализоватьНаименованиеУслуги</Name>
					<Comment>Преобразовывать наименование услуги автоматически: первая буква заглавная, остальные строчные.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура/Ext/ObjectModule.bsl
&После("ОбработкаЗаполнения")
Процедура АС_ПослеОбработкиЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	АС_ОчиститьКатегориюУслуги();
	АС_ЗаполнитьРеквизитыСозданияУслуги();

КонецПроцедуры

&Перед("ПередЗаписью")
Процедура АС_ПередЗаписьюПеред(Отказ)

	АС_ЗаполнитьРеквизитыСозданияУслуги();

КонецПроцедуры

&После("ПриЗаписи")
Процедура АС_ПослеПриЗаписи(Отказ)

	АС_ОчиститьКатегориюУслуги();

КонецПроцедуры

Процедура АС_ЗаполнитьРеквизитыСозданияУслуги()

	Если ОбменДанными.Загрузка
		Или ЭтоГруппа
		Или ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		СотрудникиПользователя = РегистрыСведений.СотрудникиПользователя.ПолучитьСотрудниковПользователя(
			Пользователи.ТекущийПользователь());
		Если СотрудникиПользователя.Количество() > 0 Тогда
			Ответственный = СотрудникиПользователя[0];
		Иначе
			Ответственный = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойОтветственный");
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;

	АС_ПрименитьНормализациюНаименованияУслуги();

КонецПроцедуры

Процедура АС_ПрименитьНормализациюНаименованияУслуги()

	Если Не АС_НормализоватьНаименованиеУслуги Тогда
		Возврат;
	КонецЕсли;

	НаименованиеУслуги = Строка(Наименование);
	Если ПустаяСтрока(СокрЛП(НаименованиеУслуги)) Тогда
		Возврат;
	КонецЕсли;

	Наименование = АС_НормализоватьНаименование(НаименованиеУслуги);
	НаименованиеПолное = Наименование;

КонецПроцедуры

Функция АС_НормализоватьНаименование(Значение)

	Результат = СокрЛП(СтрЗаменить(Строка(Значение), Символы.НПП, " "));
	Результат = НРег(Результат);
	Если СтрДлина(Результат) > 0 Тогда
		Результат = ВРег(Лев(Результат, 1)) + Сред(Результат, 2);
	КонецЕсли;
	Возврат Результат;

КонецФункции

Процедура АС_ОчиститьКатегориюУслуги()

	Если ЭтоГруппа
		Или ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
		Возврат;
	КонецЕсли;

	КатегорияНоменклатуры = ПредопределенноеЗначение(
		"Справочник.КатегорииНоменклатуры.ПустаяСсылка");

КонецПроцедуры
